import java.util.Scanner;

public class test {
	public static void main(String[] args) {
		System.out.print("Введите текст: "); //Пригашение ввести текст
		Scanner s = new Scanner(System.in); //создаем сканер s
		String str = s.nextLine(); //Считываем текст
		int c = 0; //Объявляем переменную c для хранения кода символа
		for (int i = 0; i < str.length(); i++) { //Цикл для вывода текста
			System.out.print(str.charAt(i)); //Выводим каждую букву текста
			System.out.print("  "); //Делаем два пробела
		}
		System.out.println(); //Переходим на следующую строку
		for (int i = 0; i < str.length(); i++) { //Начинаем цикл для вывода кода символов
			c = str.codePointAt(i);		//Записываем в "c" код символа
			if (c > 1103 & c != 1025 & c != 1105 & c != 32 || c < 1040 & c != 1025
					& c != 1105 & c != 32) {//Если это не русская раскладка, не пробел
				System.out.print("?  "); //Тогда пишем знак "?  " 
			}
			if (c == 32) { //Если пробел
				System.out.print("   "); //Пишем "  "
			} else if (c >= 1072 & c <= 1103 || c == 1105) {//Иначе если Русский алфавит маленькие буквы или если "ё"
				if (c == 1105) { //Если "ё"
					System.out.print("7  "); //Пишем "7  "
				} else if (c - 1071 >= 7) { //Если после буквы "ё"
					if (c - 1071 >= 9) {//Тогда если двузначная цифра
						System.out.print(c - 1071 + 1 + " ");//Пишем двузначную цифру и один пробел (Прибавляем +1 к коду символа из-за ё)
					} else //Иначе
						System.out.print(c - 1071 + 1 + "  ");//Пишем однозначную цифру и два пробела (Прибавляем +1 к коду символа из-за ё)
				
				} else//Иначе
					System.out.print(c - 1071 + "  ");//Пишем цифру и два пробела
			} else if (c >= 1040 & c <= 1071 || c == 1025) {//Иначе если алфавит русский большие буквы или если "Ё"
				if (c == 1025) {//Если "Ё"
					System.out.print("7  ");//Пишем "7  "
				} else if (c - 1039 >= 7) {//Иначе если после буквы "Ё"
					if (c - 1039 >= 9) {//Тогда если двузначная цифра
						System.out.print(c - 1039 + 1 + " ");//Пишем двузначную цифру и один пробел (Прибавляем +1 к коду символа из-за Ё)
					} else//Иначе
						System.out.print(c - 1039 + 1 + "  ");//Пишем однозначную цифру и два пробела (Прибавляем +1 к коду символа из-за Ё)
				}  else//Иначе
					System.out.print(c - 1039 + "  ");//Выводим код и два пробела
				if (c == 32) { //Если пробел
					System.out.print("   "); //Тогда выводим два пробела
				}
				
			}

		}
	}
}
